//------------#1----------------
// let sum = 0;
// let number = 1;

// num = +prompt("s=1+3+5+...n \nВведите нечетное число n");

// while(number<=num){
//     sum += number;
//     number+=2;
// }
// alert(`S = ${sum}`);


//------------#2----------------

// let k = +prompt("Введите факториал числа");
// let a = 1, b = 1;
// while(b<=k){
//     a*=b;
//     b+=1;
// }
// alert(`${a}`);


//------------#3----------------

// let num = prompt("Введите целое положительное число");
// let n = 1;
// while( (num /= 10) > 1){
//     n++;
// }
// alert(n);